load-generator/old/test-burst-30s-2waves-cold.yml
config:
  target: 'http://10.89.186.87:31112'
  http:
    timeout: 120

  phases:
    - arrivalRate: 0.2
      duration: 7.5
    - arrivalRate: 0.4
      duration: 7.5
    - arrivalRate: 0.6
      duration: 7.5
    - arrivalRate: 0.8
      duration: 7.5
    - arrivalRate: 1
      duration: 180
    - arrivalRate: 0.8
      duration: 7.5
    - arrivalRate: 0.6
      duration: 7.5
    - arrivalRate: 0.4
      duration: 7.5
    - arrivalRate: 0.2
      duration: 7.5
    - arrivalRate: 0.1
      duration: 480

    - arrivalRate: 0.2
      duration: 7.5
    - arrivalRate: 0.4
      duration: 7.5
    - arrivalRate: 0.6
      duration: 7.5
    - arrivalRate: 0.8
      duration: 7.5
    - arrivalRate: 1
      duration: 180
    - arrivalRate: 0.8
      duration: 7.5
    - arrivalRate: 0.6
      duration: 7.5
    - arrivalRate: 0.4
      duration: 7.5
    - arrivalRate: 0.2
      duration: 7.5
    - arrivalRate: 0.1
      duration: 480

  processor: "./metrics.js"
scenarios:
  - flow:
      - get:
          url: "/function/primality"
          beforeRequest: "beforeRequest"
          afterResponse: "afterResponse"